In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

In [1]:
import sqlite3
import pandas as pd

db = sqlite3.connect("/Users/awesome/Downloads/Python/SQL/Databases/hubway.db")

def run_query(query):
    return pd.read_sql_query(query, db)

In [2]:
query = 'select * from sqlite_master;'
run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,trips,trips,2,"CREATE TABLE trips (id INTEGER, duration INTEG..."
1,table,stations,stations,33340,"CREATE TABLE stations (id INTEGER, station TEX..."

In [ ]:
db.row_factory = sqlite3.Row
cur = db.cursor()
cur.execute('SELECT * FROM trips')
c = cur.fetchone()
print(c.keys())

['id', 'duration', 'start_date', 'start_station', 'end_date', 'end_station', 'bike_number', 'sub_type', 'zip_code', 'birth_date', 'gender']

In [ ]:
query = 'PRAGMA table_info("trips");'
run_query(query)

    cid           name      type  notnull dflt_value  pk
0     0             id   INTEGER        0       None   0
1     1       duration   INTEGER        0       None   0
2     2     start_date  DATETIME        0       None   0
3     3  start_station   INTEGER        0       None   0
4     4       end_date  DATETIME        0       None   0
5     5    end_station   INTEGER        0       None   0
6     6    bike_number      TEXT        0       None   0
7     7       sub_type      TEXT        0       None   0
8     8       zip_code      TEXT        0       None   0
9     9     birth_date      REAL        0       None   0
10   10         gender      TEXT        0       None   0

In [ ]:
query = 'PRAGMA table_info("stations");'
run_query(query)

   cid          name     type  notnull dflt_value  pk
0    0            id  INTEGER        0       None   0
1    1       station     TEXT        0       None   0
2    2  municipality     TEXT        0       None   0
3    3           lat                 0       None   0
4    4           lng                 0       None   0

In [ ]:
query = 'select * from trips limit 3;'
run_query(query)

   id  duration           start_date  ...  zip_code birth_date  gender
0   1         9  2011-07-28 10:12:00  ...    '97217     1976.0    Male
1   2       220  2011-07-28 10:21:00  ...    '02215     1966.0    Male
2   3        56  2011-07-28 10:33:00  ...    '02108     1943.0    Male

[3 rows x 11 columns]

In [ ]:
#What was the duration of the longest trip?
query = 'select duration from trips order by duration DESC;'
run_query(query)

         duration
0            9999
1            9998
2            9998
3            9997
4            9996
...           ...
1569996         0
1569997         0
1569998         0
1569999         0
1570000         0

[1570001 rows x 1 columns]

In [ ]:
#sql is closed
db.close()

In [ ]:
#sql table is df 
import sqlite3
import pandas as pd

db = sqlite3.connect("/content/gdrive/My Drive/db_files/hubway.db")
trips_df = pd.read_sql_query("SELECT * from trips", db)
trips_df.head()

   id  duration           start_date  ... zip_code birth_date  gender
0   1         9  2011-07-28 10:12:00  ...   '97217       1976    Male
1   2       220  2011-07-28 10:21:00  ...   '02215       1966    Male
2   3        56  2011-07-28 10:33:00  ...   '02108       1943    Male
3   4        64  2011-07-28 10:35:00  ...   '02116       1981  Female
4   5        12  2011-07-28 10:37:00  ...   '97214       1983  Female

[5 rows x 11 columns]

In [ ]:
stations_df = pd.read_sql_query("SELECT * from stations", db)
stations_df.head()

   id                             station  ...                 lat         lng
0   3              Colleges of the Fenway  ...           42.340021  -71.100812
1   4         Tremont St. at Berkeley St.  ...           42.345392  -71.069616
2   5  Northeastern U / North Parking Lot  ...           42.341814  -71.090179
3   6            Cambridge St. at Joy St.  ...  42.361284999999995   -71.06514
4   7                            Fan Pier  ...           42.353412  -71.044624

[5 rows x 5 columns]

In [ ]:
#db is closed once df is made
db.close()

In [ ]:
trips_df.head()

   id  duration           start_date  ... zip_code birth_date  gender
0   1         9  2011-07-28 10:12:00  ...   '97217       1976    Male
1   2       220  2011-07-28 10:21:00  ...   '02215       1966    Male
2   3        56  2011-07-28 10:33:00  ...   '02108       1943    Male
3   4        64  2011-07-28 10:35:00  ...   '02116       1981  Female
4   5        12  2011-07-28 10:37:00  ...   '97214       1983  Female

[5 rows x 11 columns]

## 1. What was the duration of the longest trip?

In [ ]:
max(trips_df['duration'])

9999

In [ ]:
trips_df['duration'].max()

9999

In [ ]:
query = 'select max(duration) from trips;'
run_query(query)

   max(duration)
0           9999

## 2. How many trips were taken by 'registered' users?

In [ ]:
query = 'select sub_type, COUNT(*) from trips where sub_type = "Registered";'
run_query(query)

     sub_type  COUNT(*)
0  Registered   1105192

In [ ]:
trips_df['sub_type'].value_counts()

Registered    1105192
Casual         464809
Name: sub_type, dtype: int64

In [ ]:
(trips_df['sub_type']=='Registered').sum()

1105192

In [ ]:
len(trips_df[(trips_df['sub_type']=='Registered')])

1105192

## 3. What was the average trip duration?

In [ ]:
query = 'select avg(duration) from trips;'
run_query(query)

   avg(duration)
0     912.409682

In [ ]:
trips_df['duration'].mean()

912.4096819046612

## 4. Do registered or casual users take longer trips?

In [ ]:
query = 'select sub_type, avg(duration) from trips group by sub_type;'
run_query(query)

     sub_type  avg(duration)
0      Casual    1519.643897
1  Registered     657.026067

In [ ]:
trips_df.groupby(by='sub_type').mean()

                       id     duration
sub_type
Casual      718293.248162  1519.643897
Registered  822677.335679   657.026067

## 5. Which bike was used for the most trips?

In [ ]:
query = 'select bike_number, count(bike_number) as num from trips group by bike_number order by num DESC limit 1;'
run_query(query)

  bike_number   num
0      B00490  2120

In [ ]:
trips_df['bike_number'].value_counts()

B00490    2120
B00268    2104
B00548    2099
B00559    2083
B00563    2067
          ...
T01129      49
B00218      33
B00137      28
B00542      25
T01064      10
Name: bike_number, Length: 1164, dtype: int64

## 6. What is the average duration of trips by users over the age of 30?

In [ ]:
query = 'select avg(duration) from trips where (2017-birth_date) > 30;'
run_query(query)

   avg(duration)
0     923.014685

In [ ]:
trips_df["birth_date"] = pd.to_numeric(trips_df["birth_date"])
trips_df.fillna(value=0, inplace=True)

In [ ]:
thirty_n_over = trips_df[(trips_df['birth_date'] < 1987)]
thirty_n_over['duration'].mean()

923.0146846543805

## Which station is the most frequent starting point?

In [ ]:
query = 'select s.id, s.station, count(*) as num \
from trips as t \
join stations as s \
on t.start_station = s.id \
group by s.id, s.station \
order by num \
desc limit 5;'
run_query(query)

   id                                   station    num
0  22         South Station - 700 Atlantic Ave.  56123
1  36  Boston Public Library - 700 Boylston St.  41994
2  53                      Beacon St / Mass Ave  35275
3  67              MIT at Mass Ave / Amherst St  33644
4  16              Back Bay / South End Station  32677

In [ ]:
trips_df.head()

   id  duration           start_date  ... zip_code birth_date  gender
0   1         9  2011-07-28 10:12:00  ...   '97217       1976    Male
1   2       220  2011-07-28 10:21:00  ...   '02215       1966    Male
2   3        56  2011-07-28 10:33:00  ...   '02108       1943    Male
3   4        64  2011-07-28 10:35:00  ...   '02116       1981  Female
4   5        12  2011-07-28 10:37:00  ...   '97214       1983  Female

[5 rows x 11 columns]

In [ ]:
stations_df.head()

   id                             station  ...                 lat         lng
0   3              Colleges of the Fenway  ...           42.340021  -71.100812
1   4         Tremont St. at Berkeley St.  ...           42.345392  -71.069616
2   5  Northeastern U / North Parking Lot  ...           42.341814  -71.090179
3   6            Cambridge St. at Joy St.  ...  42.361284999999995   -71.06514
4   7                            Fan Pier  ...           42.353412  -71.044624

[5 rows x 5 columns]

In [ ]:
merged_df = pd.merge(left=trips_df, right=stations_df, left_on='start_station', right_on='id')
merged_df.head()

   id_x  duration  ...                 lat         lng
0     1         9  ...  42.359677000000005  -71.059364
1     2       220  ...  42.359677000000005  -71.059364
2     3        56  ...  42.359677000000005  -71.059364
3     4        64  ...  42.359677000000005  -71.059364
4     5        12  ...  42.359677000000005  -71.059364

[5 rows x 16 columns]

In [ ]:
merged_df['station'].value_counts()[:5]

South Station - 700 Atlantic Ave.                56123
Boston Public Library - 700 Boylston St.         41994
Charles Circle - Charles St. at Cambridge St.    35984
Beacon St / Mass Ave                             35275
MIT at Mass Ave / Amherst St                     33644
Name: station, dtype: int64

##Which stations are most frequently used for round trips?

In [ ]:
query = 'select s.station, count(*) as num \
from trips as t \
join stations as s \
on t.start_station = s.id \
and t.start_station = t.end_station \
group by s.station \
order by num desc \
limit 5;'
run_query(query)

                                         station   num
0    The Esplanade - Beacon St. at Arlington St.  3064
1  Charles Circle - Charles St. at Cambridge St.  2739
2       Boston Public Library - 700 Boylston St.  2548
3                  Boylston St. at Arlington St.  2163
4                           Beacon St / Mass Ave  2144

In [ ]:
import numpy as np

In [ ]:
round_trip = trips_df[['start_station','end_station']]

  start_station end_station
0            23          23
1            23          23
2            23          23
3            23          23
4            23          23

In [ ]:
# round_trip = round_trip.copy()
# round_trip["equal"] = (np.where(round_trip['start_station'] == round_trip['end_station'], True, False))

In [ ]:
# round_trip.copy()["equal"] = np.where(round_trip['start_station'] == round_trip['end_station'], True, False)

In [ ]:
round_trip = round_trip.copy()
round_trip.loc[round_trip['start_station'] == round_trip['end_station'], 'equal'] = True
round_trip.loc[round_trip['start_station'] != round_trip['end_station'], 'equal'] = False

In [ ]:
# round_trip.copy().loc[round_trip.copy()['start_station'] == round_trip.copy()['end_station'], 'equal'] = True
# round_trip.copy().loc[round_trip.copy()['start_station'] != round_trip.copy()['end_station'], 'equal'] = False

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
round_trip['equal'].value_counts()

False    1496933
True       73068
Name: equal, dtype: int64

In [ ]:
station_name = stations_df[['id','station']]
station_name.head()

   id                             station
0   3              Colleges of the Fenway
1   4         Tremont St. at Berkeley St.
2   5  Northeastern U / North Parking Lot
3   6            Cambridge St. at Joy St.
4   7                            Fan Pier

In [ ]:
merged_df2 = pd.merge(left=round_trip, right=station_name, left_on='start_station', right_on='id')
merged_df2.head()

  start_station end_station  ...  id                                     station
0            23          23  ...  23  Mayor Thomas M. Menino - Government Center
1            23          23  ...  23  Mayor Thomas M. Menino - Government Center
2            23          23  ...  23  Mayor Thomas M. Menino - Government Center
3            23          23  ...  23  Mayor Thomas M. Menino - Government Center
4            23          23  ...  23  Mayor Thomas M. Menino - Government Center

[5 rows x 5 columns]

In [ ]:
new_df = merged_df2[(merged_df2['equal']==True)]
new_df.head()

  start_station end_station  ...  id                                     station
0            23          23  ...  23  Mayor Thomas M. Menino - Government Center
1            23          23  ...  23  Mayor Thomas M. Menino - Government Center
2            23          23  ...  23  Mayor Thomas M. Menino - Government Center
3            23          23  ...  23  Mayor Thomas M. Menino - Government Center
4            23          23  ...  23  Mayor Thomas M. Menino - Government Center

[5 rows x 5 columns]

In [ ]:
s_df = new_df['station'].value_counts()[0:5]
s_df = pd.DataFrame(s_df)
s_df

                                               station
The Esplanade - Beacon St. at Arlington St.       3064
Charles Circle - Charles St. at Cambridge St.     2739
Boston Public Library - 700 Boylston St.          2548
Boylston St. at Arlington St.                     2163
Beacon St / Mass Ave                              2144

##8 How many trips start and end in different municipalities?

In [ ]:
query = 'select count(*) from trips as t \
join stations as s \
on t.start_station = s.id \
join stations as e \
on t.end_station = e.id \
where s.municipality != e.municipality;'
run_query(query)

   count(*)
0    309748

In [ ]:
m_name = stations_df[['id', 'municipality']]
m_name.head()

   id municipality
0   3       Boston
1   4       Boston
2   5       Boston
3   6       Boston
4   7       Boston

In [ ]:
m_df = pd.merge(left=round_trip, right=m_name, left_on='start_station', right_on='id')
m_df.head()

  start_station end_station  equal  id municipality
0            23          23   True  23       Boston
1            23          23   True  23       Boston
2            23          23   True  23       Boston
3            23          23   True  23       Boston
4            23          23   True  23       Boston

In [ ]:
m_df.rename(columns={'municipality':'m_ss'}, inplace=True)
column_move1 = m_df['m_ss']
m_df.drop(labels=['m_ss'], axis=1, inplace=True)
m_df.drop(labels=['id'], axis=1, inplace=True)
m_df.insert(1,'m_ss', column_move1)
m_df.head()

  start_station    m_ss end_station  equal
0            23  Boston          23   True
1            23  Boston          23   True
2            23  Boston          23   True
3            23  Boston          23   True
4            23  Boston          23   True

In [ ]:
m_df = pd.merge(left=m_df, right=m_name, left_on='end_station', right_on='id')
m_df.head()

  start_station    m_ss end_station  equal  id municipality
0            23  Boston          23   True  23       Boston
1            23  Boston          23   True  23       Boston
2            23  Boston          23   True  23       Boston
3            23  Boston          23   True  23       Boston
4            23  Boston          23   True  23       Boston

In [ ]:
m_df.rename(columns={'municipality':'m_es'}, inplace=True)
column_move1 = m_df['m_es']
m_df.drop(labels=['m_es'], axis=1, inplace=True)
m_df.drop(labels=['id'], axis=1, inplace=True)
m_df.insert(3,'m_es', column_move1)
m_df.head()

  start_station    m_ss end_station    m_es  equal
0            23  Boston          23  Boston   True
1            23  Boston          23  Boston   True
2            23  Boston          23  Boston   True
3            23  Boston          23  Boston   True
4            23  Boston          23  Boston   True

In [ ]:
m_df["diff"] = np.where(m_df['m_ss'] != m_df['m_es'], True, False)

In [ ]:
m_df.head()

  start_station    m_ss end_station    m_es  equal   diff
0            23  Boston          23  Boston   True  False
1            23  Boston          23  Boston   True  False
2            23  Boston          23  Boston   True  False
3            23  Boston          23  Boston   True  False
4            23  Boston          23  Boston   True  False

In [ ]:
m_df['diff'].value_counts()

False    1260218
True      309748
Name: diff, dtype: int64

In [ ]:
(m_df['diff']==True).sum()

309748

## 9. How many trips incurred additional fees (lasted longer than 30 minutes)?

In [ ]:
len(trips_df[(trips_df['duration'] > 60*30)])

123155

In [ ]:
query = 'select count(*) \
from trips \
where duration > 60 * 30;'
run_query(query)

   count(*)
0    123155

## 10. Which bike was used for the longest total time?

In [ ]:
query = 'select bike_number, sum(duration) as num \
from trips \
group by bike_number \
order by num desc \
limit 5;'
run_query(query)

  bike_number      num
0      B00490  2058643
1      B00548  1996532
2      B00329  1986397
3      B00268  1969755
4      B00355  1965279

In [ ]:
query = 'select bike_number, max(num) \
from (select bike_number, sum(duration) as num \
from trips \
group by bike_number \
order by num desc);'
run_query(query)

  bike_number  max(num)
0      B00490   2058643

In [ ]:
trips_df.head()

   id  duration           start_date  ... zip_code birth_date  gender
0   1         9  2011-07-28 10:12:00  ...   '97217       1976    Male
1   2       220  2011-07-28 10:21:00  ...   '02215       1966    Male
2   3        56  2011-07-28 10:33:00  ...   '02108       1943    Male
3   4        64  2011-07-28 10:35:00  ...   '02116       1981  Female
4   5        12  2011-07-28 10:37:00  ...   '97214       1983  Female

[5 rows x 11 columns]

In [ ]:
trips_df.groupby(['bike_number'])['duration'].sum().sort_values(ascending=False).head(5)

bike_number
B00490    2058643
B00548    1996532
B00329    1986397
B00268    1969755
B00355    1965279
Name: duration, dtype: int64

## 11. Did registered or casual users take more round trips?

In [ ]:
query = 'select t.sub_type, count(*) \
from trips as t \
join stations as ss \
on t.start_station = ss.id \
join stations as es \
on t.end_station = es.id \
where t.start_station = t.end_station \
group by sub_type'
run_query(query)

     sub_type  count(*)
0      Casual     41427
1  Registered     31635

In [ ]:
query = 'select sub_type, count(*) \
from trips t, stations s \
where t.start_station = s.id \
and t.start_station = t.end_station \
group by sub_type \
order by count(*) desc;'
run_query(query)

     sub_type  count(*)
0      Casual     41427
1  Registered     31635

In [ ]:
round_trip = trips_df[['start_station','end_station', 'duration', 'sub_type']]
s_name = stations_df[['id', 'station']]
s_df = pd.merge(left=round_trip, right=s_name, left_on='start_station', right_on='id')
s_df.head()

  start_station end_station  ...  id                                     station
0            23          23  ...  23  Mayor Thomas M. Menino - Government Center
1            23          23  ...  23  Mayor Thomas M. Menino - Government Center
2            23          23  ...  23  Mayor Thomas M. Menino - Government Center
3            23          23  ...  23  Mayor Thomas M. Menino - Government Center
4            23          23  ...  23  Mayor Thomas M. Menino - Government Center

[5 rows x 6 columns]

In [ ]:
s_df.rename(columns={'station':'s_ss'}, inplace=True)
column_move1 = s_df['s_ss']
s_df.drop(labels=['s_ss'], axis=1, inplace=True)
s_df.drop(labels=['id'], axis=1, inplace=True)
s_df.insert(1,'s_ss', column_move1)
s_df.head()

  start_station  ...    sub_type
0            23  ...  Registered
1            23  ...  Registered
2            23  ...  Registered
3            23  ...  Registered
4            23  ...  Registered

[5 rows x 5 columns]

In [ ]:
s_df = pd.merge(left=s_df, right=s_name, left_on='end_station', right_on='id')
s_df.head()

  start_station  ...                                     station
0            23  ...  Mayor Thomas M. Menino - Government Center
1            23  ...  Mayor Thomas M. Menino - Government Center
2            23  ...  Mayor Thomas M. Menino - Government Center
3            23  ...  Mayor Thomas M. Menino - Government Center
4            23  ...  Mayor Thomas M. Menino - Government Center

[5 rows x 7 columns]

In [ ]:
s_df.rename(columns={'station':'s_es'}, inplace=True)
column_move1 = s_df['s_es']
s_df.drop(labels=['s_es'], axis=1, inplace=True)
s_df.drop(labels=['id'], axis=1, inplace=True)
s_df.insert(3,'s_es', column_move1)
s_df.head()

  start_station  ...    sub_type
0            23  ...  Registered
1            23  ...  Registered
2            23  ...  Registered
3            23  ...  Registered
4            23  ...  Registered

[5 rows x 6 columns]

In [ ]:
df = s_df.loc[(s_df['start_station'] == s_df['end_station'])]
df['sub_type'].value_counts()

Casual        41427
Registered    31635
Name: sub_type, dtype: int64

## 12. Which municipality had the longest average duration?

In [ ]:
query = 'select ss.municipality, avg(duration) as avg \
from trips as t \
join stations as ss \
on t.start_station = ss.id \
join stations as es \
on t.end_station = es.id \
group by ss.municipality \
order by avg desc;'
run_query(query)

  municipality          avg
0    Brookline  1020.844836
1       Boston   929.211651
2   Somerville   866.462890
3    Cambridge   842.174272

In [ ]:
query = 'select ss.municipality, avg(duration) as avg \
from trips as t \
join stations as ss \
on t.start_station = ss.id \
join stations as es \
on t.end_station = es.id \
group by ss.municipality \
order by 2 desc;'
run_query(query)

  municipality          avg
0    Brookline  1020.844836
1       Boston   929.211651
2   Somerville   866.462890
3    Cambridge   842.174272

In [ ]:
query = '''
select municipality, avg(duration) avg 
from trips t, stations s 
where t.start_station = s.id 
--where t.end_station = s.id 
group by municipality 
order by avg desc;
'''
run_query(query)

  municipality          avg
0    Brookline  1020.844836
1       Boston   929.211749
2   Somerville   866.462890
3    Cambridge   842.171816

In [ ]:
query = '''
select municipality, avg(duration) avg
from trips t, stations s
where t.start_station = s.id
--where t.end_station = s.id
group by municipality
order by avg desc;
'''
run_query(query)

  municipality          avg
0    Brookline  1020.844836
1       Boston   929.211749
2   Somerville   866.462890
3    Cambridge   842.171816

In [ ]:
round_trip = trips_df[['start_station','end_station', 'duration']]
m_name = stations_df[['id', 'municipality']]
m_df = pd.merge(left=round_trip, right=m_name, left_on='start_station', right_on='id')
m_df.head()

  start_station end_station  duration  id municipality
0            23          23         9  23       Boston
1            23          23       220  23       Boston
2            23          23        56  23       Boston
3            23          23        64  23       Boston
4            23          23        12  23       Boston

In [ ]:
m_df.rename(columns={'municipality':'m_ss'}, inplace=True)
column_move1 = m_df['m_ss']
m_df.drop(labels=['m_ss'], axis=1, inplace=True)
m_df.drop(labels=['id'], axis=1, inplace=True)
m_df.insert(1,'m_ss', column_move1)
m_df.head()

  start_station    m_ss end_station  duration
0            23  Boston          23         9
1            23  Boston          23       220
2            23  Boston          23        56
3            23  Boston          23        64
4            23  Boston          23        12

In [ ]:
m_df = pd.merge(left=m_df, right=m_name, left_on='end_station', right_on='id')
m_df.head()

  start_station    m_ss end_station  duration  id municipality
0            23  Boston          23         9  23       Boston
1            23  Boston          23       220  23       Boston
2            23  Boston          23        56  23       Boston
3            23  Boston          23        64  23       Boston
4            23  Boston          23        12  23       Boston

In [ ]:
m_df.rename(columns={'municipality':'m_es'}, inplace=True)
column_move1 = m_df['m_es']
m_df.drop(labels=['m_es'], axis=1, inplace=True)
m_df.drop(labels=['id'], axis=1, inplace=True)
m_df.insert(3,'m_es', column_move1)
m_df.head()

  start_station    m_ss end_station    m_es  duration
0            23  Boston          23  Boston         9
1            23  Boston          23  Boston       220
2            23  Boston          23  Boston        56
3            23  Boston          23  Boston        64
4            23  Boston          23  Boston        12

In [ ]:
ss_df = m_df.groupby(['m_ss'])['duration'].mean().sort_values(ascending=False)
ss_df=pd.DataFrame(ss_df)
ss_df.reset_index(inplace=True)
ss_df.rename(columns={'m_ss':'station'}, inplace=True)

In [ ]:
ss_df.head()

      station     duration
0   Brookline  1020.844836
1      Boston   929.211651
2  Somerville   866.462890
3   Cambridge   842.174272

In [ ]:
es_df = m_df.groupby(['m_es'])['duration'].mean().sort_values(ascending=False)
es_df=pd.DataFrame(es_df)
es_df.reset_index(inplace=True)
es_df.rename(columns={'m_es':'station'}, inplace=True)

In [ ]:
es_df.head()

      station     duration
0   Brookline  1069.855975
1      Boston   929.435450
2  Somerville   873.632675
3   Cambridge   837.164237

In [ ]:
result = pd.merge(left=ss_df, right=es_df, left_on='station', right_on='station')
result.head()

      station   duration_x   duration_y
0   Brookline  1020.844836  1069.855975
1      Boston   929.211651   929.435450
2  Somerville   866.462890   873.632675
3   Cambridge   842.174272   837.164237

In [ ]:
result.rename(columns={'duration_x':'m_ss', 'duration_y':'m_es'}, inplace=True)
result.head()

      station         m_ss         m_es
0   Brookline  1020.844836  1069.855975
1      Boston   929.211651   929.435450
2  Somerville   866.462890   873.632675
3   Cambridge   842.174272   837.164237